Repository: shoonne/GymBuddy
Catalog: GymBuddy/*.lproj/Localizable.strings
Languages: sv

source: Both fields must not be blank
sv: Båda fälten får ej vara blanka

source: Camera
sv: Kamera

source: Choose your photo source
sv: Välj din foto källa

source: Delete
sv: Ta bort

source: Edit item
sv: Ändra inlägget

source: Edit muscle group
sv: Ändra muskelgrupp

source: Edit workout description
sv: Ändra träningsbeskrivning

source: Edit workout location
sv: Ändra träningsplats

source: Edit your workout
sv: Ändra din träning

source: How do you train to get six-pack abs? You can do it with long and complicated training, like many people do, but in my book, the best ab workout is the one you'll do over and over again.Yes, it's true that that abs are earned in the kitchen—not the gym. But if six-pack abs are your goal, it's also important to pick the right ab workout for the job. Here is the thing that many people, including a lot of trainers, overlook: diet. The single most important tool that you need in order to develop your abs is diet. Regardless of what you've heard, or what the latest hyped up fat loss pill promised you, abs are made in the kitchen and not in the gym. You could have the best training program of all time, but if your diet sucks, so will your abs. In fact, diet is responsible for about 90% of your results. The secret to six pack abs is not locked in a supplement pill or found in an ab workout or gadget. Instead of falling for the empty promises, spend your time focusing on the things that matter, like solid nutrition principles, and leave the rest of the stuff alone.So, no, the odds are not in your favor, but you can work toward a more defined midsection by developing core strength and reducing overall body fat. Although everyone responds differently to diet and exercise — and you should consult with a healthcare provider before changing things up — here are the lifestyle tips that have worked for three trainers who have particularly chiseled abs. Eat carbs. Though protein is a big part of her diet, Gozo says she doesn't shy away from carbohydrate-packed foods like fruit, rice, and other whole grains. That's because these foods are also rich sources of fiber, which aid in digestion and reduce bloating.
sv: Hur tränar du för att få sex-pack abs? Du kan göra det med lång och komplicerad träning, som många människor gör, men i min bok är den bästa ab träningen den som du ska göra om och om igen. Ja, det är sant att absen tjänas i köket - inte gymmet. Men om sexpack abs är ditt mål är det också viktigt att välja rätt träningspass för jobbet. Här är det som många människor, inklusive en hel del utbildare, förbiser: diet. Det enda viktigaste verktyget du behöver för att utveckla din abs är kost. Oavsett vad du har hört, eller vad den senaste hyped up fettförlustpillen lovade dig, görs abs i köket och inte i gymmet. Du kan ha det bästa träningsprogramet hela tiden, men om din kost suger, så kommer din abs. Faktum är att kost är ansvarig för cirka 90% av dina resultat. Hemligheten till sex pack abs är inte låst i ett tillskottspiller eller finns i en ab träning eller gadget. I stället för att falla för de tomma löften, spendera din tid med fokus på de saker som spelar roll, som fasta näringsprinciper, och lämna resten av sakerna ensamma. Så nej, oddsen är inte till din tjänst, men du kan arbeta mot en mer definierad midsektion genom att utveckla kärnstyrkan och reducera det totala kroppsfettet. Även om alla svarar annorlunda mot kost och motion - och du borde rådgöra med en vårdgivare innan du ändrar sakerna - här är de livsstilstips som har fungerat för tre tränare som har speciellt mejslad abs. Ät kolhydrater. Även om protein är en stor del av hennes kost, säger Gozo att hon inte skämmer bort från kolhydrerade förpackade livsmedel som frukt, ris och andra hela korn. Det beror på att dessa livsmedel också är rika fiberkällor, vilket bidrar till matsmältning och minskar uppblåsthet.

source: If you are—or aspire to be—a physique competitor or bodybuilder, I don't need to impress upon you how critical it is to have a well-developed back. As for the rest of you, I get that it may take some convincing. You don't see your back when you're looking in the mirror, and people don't see it when you're entering a room, so it's understandable if back development isn't at the top of your workout schedule. But ask yourself this: What do people see when they look at you from behind? Are they dazzled by a rugged, thick, flaring wedge of iron? Or is there a void between your shoulders; a flat, muscle-less expanse that cries weakness? You've got to respect your back, brother, so here are six workouts for six specific back-development goals. Choose the one (or more) that matches your individual needs, then go after it for 4-6 weeks to become a true 360-degree badass.
sv: Om du är - eller strävar efter att vara en kroppsbyggare eller kroppsbyggare, behöver jag inte imponera på dig hur kritiskt det är att ha en välutvecklad rygg. När det gäller resten av dig får jag det att det kan ta lite övertygande. Du ser inte din rygg när du tittar i spegeln, och folk ser det inte när du går in i ett rum, så det är förståeligt om tillbaka utveckling inte ligger längst upp i ditt träningsprogram. Men fråga dig själv: Vad ser folk när de tittar på dig bakifrån? Blir de bländad av en robust, tjock, flakande kil av järn? Eller är det ett tomrum mellan dina axlar? en platt, muskelfri yta som gråter svaghet? Du måste respektera din rygg bror, så här är sex träningspassar för sex specifika utvecklingsmål. Välj den (eller fler) som matchar dina individuella behov, följ sedan efter det i 4-6 veckor för att bli en sann 360 graders badass

source: In case you missed it: Strong legs are super-important—beyond just looking awesome in a booty pic. They’re literally what keep you moving all day, so building strength in your lower half (yes, butt included) is crucial. Unfortunately, too many people neglect leg day a) because they think they’re already working their legs all day and b) because the leg muscles are so large to begin with, it takes longer to see results, says Emily Samuel, a NASM-certified trainer at the Dogpound in New York City. Don’t do that! “You should be training your legs at least once a week,” she says. #NeverSkipLegDay. Start working three or four of these moves into your workout routine, and switching things up every couple of weeks. You may not see the difference right away, but you’ll definitely feel it.Leg day consists of exercises for several muscle groups, as discussed above, and many of the exercises are among the most demanding movements you'll do in any given week. Sometimes that makes training hamstrings an afterthought. Rather than trying to muster the energy to push through ham-specific movements, many bodybuilders simply opt to train their hammies on another day, often separated by at least 48 hours from their main quad session.
sv: Om du saknade det: Starka ben är super viktiga - bortom att bara se fantastiskt ut i en booty-bild. De är bokstavligen vad som håller dig med på att flytta hela dagen, så att bygga styrka i din nedre hälft (ja, rumpa ingår) är avgörande. Tyvärr för många människor försummar bendag a) för att de tror att de redan arbetar benen hela dagen och b) eftersom benmusklerna är så stora till att börja med tar det längre tid att se resultat, säger Emily Samuel, en NASM- certifierad tränare på Dogpound i New York City. Gör inte det! "Du borde träna dina ben minst en gång i veckan", säger hon. #NeverSkipLegDay. Börja jobba tre eller fyra av dessa rörelser i din träningsrutin och byta saker upp varje par veckor. Du kanske inte ser skillnaden omedelbart, men du kommer definitivt att känna dig. Dagens dag består av övningar för flera muskelgrupper, som diskuterats ovan, och många av övningarna är bland de mest krävande rörelserna du kommer att göra under en viss vecka . Ibland gör träningshamstrings en eftertanke. I stället för att försöka att mönstra energin att driva genom skamspecifika rörelser väljer många kroppsbyggare helt enkelt att träna sina hammar på en annan dag, ofta åtskilda av åtminstone 48 timmar från deras huvudsakliga quadsession

source: Legs
sv: Ben

source: Log In
sv: Logga in

source: Login Error
sv: Login Fel

source: Looking for objects...
sv: Letar efter objekt...

source: OK
sv: OKEJ

source: Photo library
sv: Bildbibliotek

source: Please make sure you provide your name, email adress and password to complete the registration
sv: "Se till att förse med namn, email och lösenord för att färdigställa registrationen"

source: Registraion error
sv: Fel med registration

source: Resistance training that improves your upper body strength is the best way to get lean, toned and strong. Use your own body weight or, even better, add dumbbells or kettlebells. A great starting point is with five- to 10-pound dumbbells or a 15- to 20-pound kettlebell – but remember, good form and control is important. To avoid injury, move up to heavier weights only when you are comfortable that you’re strong enough to handle it.Next time you're looking to get in an arm workout at home, try combining 4 to 6 of the 16 moves below to create a workout—doing 45 seconds of each move, with 15 seconds of rest in between, and then repeating the whole thing three times, is a good place to start. Some of these arm exercises focus more on specific muscles like the triceps, while others will really challenge the shoulder muscles (including the deltoids and rhomboids), the pecs, and latissimus dorsi (or the lats, the broadest muscles on each side of your back). These are all important areas to strengthen, not only so you can lift heavier weights, but also so you can comfortably perform activities of daily living like carrying grocery bags or lifting your suitcase.Sticking to the same grip from workout to workout, month after month, is a mistake. This is a problem if you're wanting jacked arms. Without variety, you're overstressing the same movement and muscle recruitment patterns. Your arms adapt from the same form of stress. A lack of variety can lead to a desensitized training effect, aggravate the elbow from overuse, and leave you with unbalanced arm development.While you can't completely isolate a muscle within a muscle group, you can give the elbows a rest from redundant movement patterns, and stimulate stagnant muscle fibers. Here's a quick overview of different hand positions and how they'll affect your training response.
sv: Motståndsträning som förbättrar din överkroppsstyrka är det bästa sättet att bli mager, tonad och stark. Använd din egen kroppsvikt eller, till och med bättre, lägg till hantlar eller kettlebells. En bra utgångspunkt är med fem- till 10-pund hantlar eller en 15- till 20-pund kettlebell - men kom ihåg att bra form och kontroll är viktigt. För att undvika skada, rör dig bara till tyngre vikter när du är bekväm att du är tillräckligt stark för att hantera den. Nästa gång du letar för att träna i ett armträning hemma, försök kombinera 4 till 6 av de 16 rörelserna nedan för att skapa ett träningspass - gör 45 sekunder av varje drag, med 15 sekunder vila däremellan, och sedan upprepa det hela tre gånger, är ett bra ställe att börja. Några av dessa armövningar fokuserar mer på specifika muskler som triceps, medan andra verkligen kommer att utmana axelmusklerna (inklusive deltoiderna och rhomboiderna), pecs och latissimus dorsi (eller latsna, de bredaste musklerna på varje sida av ryggen ). Dessa är alla viktiga områden för att stärka, inte bara så att du kan lyfta tyngre vikter, men också så att du bekvämt kan utföra aktiviteter i det dagliga livet som att transportera livsmedelspåsar eller lyfta din resväska. Stickar till samma grepp från träning till träning, månad efter månad , är ett misstag. Detta är ett problem om du vill ha jackade armar. Utan variation överträder du samma rörelse och muskelrekryteringsmönster. Armarna anpassar sig från samma stressform. Brist på mångfald kan leda till en desensibiliserad träningseffekt, försvaga armbågen från överanvändning och lämna dig med obalanserad armutveckling. Även om du inte helt kan isolera en muskel i en muskelgrupp kan du ge armbågorna en vila från överflödig rörelse mönster och stimulera stillastående muskelfibrer. Här är en snabb översikt över olika handpositioner och hur de påverkar ditt träningssvar.

source: Sign Up
sv: Registrera

source: The short, non-scientific answer to how often to do cardio workouts is to do more than you probably think you should and more than you really want to or have the time for.The longer answer is that it depends on your fitness level, schedule, and goals. If you want to be healthy and aren't worried about losing weight, getting in 20-30 minutes of moderate activity every day can do you some good. But, for weight loss, it's a whole other story. And it's not just about frequency. It's about intensity as well. If you only do moderate workouts, you can probably workout every day. But, if you do high-intensity interval training, you may need more rest days in between workout days. The bottom line is that it's better to have a mixture of the two so that you're working different energy systems and giving your body something different to do so you don't burn out.Frequency is the number of cardio training sessions performed per day or per week. This will be dependent on training status and intensity. 2 to 5 sessions per week will suffice. This depends on concurrent training — in other words, what other activities and/or sports you’re doing. You can attain health benefits by expending as little as 150 calories per day via cardio training. 20 minutes of cardio training, 3 times per week can maintain cardiovascular fitness levels (assuming the intensity is appropriate).Intensity of the cardio training can be monitored via heart rate response or oxygen uptake. The most practical method is measuring heart rate using a heart rate monitor or a simple pulse count. To attain optimal cardiovascular fitness, exercise between 60-90% of maximal heart rate (50-85% of heart rate reserve).
sv: Det korta, icke-vetenskapliga svaret på hur ofta du gör kardio träning är att göra mer än du troligen tror att du borde och mer än du verkligen vill eller har tid för. Det längre svaret är att det beror på din träningsnivå, schema , och mål. Om du vill vara frisk och inte orolig för att gå ner i vikt, kan du få lite bra på 20-30 minuter med måttlig aktivitet varje dag. Men för viktminskning är det en helt annan historia. Och det handlar inte bara om frekvens. Det handlar också om intensitet. Om du bara gör måttliga träningspassar, kan du troligen träna varje dag. Men om du gör intensivintervallträning kan du behöva mer vilodag mellan träningsdagarna. Grunden är att det är bättre att ha en blandning av de två så att du arbetar med olika energisystem och ger din kropp något annorlunda att göra så att du inte brinner ut. Frekvensen är antalet kardio träningssessioner som utförs per dag eller per vecka. Detta kommer att vara beroende av träningsstatus och intensitet. 2 till 5 sessioner per vecka räcker. Det beror på samtidig träning - med andra ord, vilka andra aktiviteter och / eller sportar du gör. Du kan uppnå hälsofördelar genom att utgöra så lite som 150 kalorier per dag via hjärtutbildning. 20 minuters konditionsträning, 3 gånger per vecka kan upprätthålla konditionsträningsnivåer (förutsatt att intensiteten är lämplig). Intensiteten i kardioutbildningen kan övervakas via hjärtfrekvensrespons eller syreupptagning. Den mest praktiska metoden är att mäta hjärtfrekvensen med hjälp av en hjärtfrekvensmätare eller ett enkelt pulsantal. För att uppnå optimal kardiovaskulär träning, träna mellan 60-90% 1 $ av maximal hjärtfrekvens (50-85% 2 $ av hjärtfrekvensreserven

source: We can't proceed because one of the fields is blank. Please note that all fields are required.
sv: En av fälten är blanka. Alla fält är obligatoriska

source: WORKOUT LOCATION
sv: TRÄNINGSPLATS
